# Prática de Ciência de Dados
* Aplicarei todos os conhecimentos adquirido na Formação Cientista de Dados (http://encurtador.com.br/aVX68)
 * Analisarei o DataSet German Credit Risk do Kaggle (http://encurtador.com.br/mGS17)

In [1]:
# Importando as biblioteca
import pandas as pd 
import seaborn as srn 
import statistics as sts 
import matplotlib.pyplot as plt
import numpy as np

In [2]:
# base de dados
df = pd.read_csv('credit.csv')
df.shape

(1000, 10)

In [3]:
df.head()

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

In [4]:
# removendo a coluna Unnamed: 0
df = df.drop(['Unnamed: 0'], axis = 1)
df.describe()

               Age          Job  Credit amount     Duration
count  1000.000000  1000.000000    1000.000000  1000.000000
mean     35.546000     1.904000    3271.258000    20.903000
std      11.375469     0.653614    2822.736876    12.058814
min      19.000000     0.000000     250.000000     4.000000
25%      27.000000     2.000000    1365.500000    12.000000
50%      33.000000     2.000000    2319.500000    18.000000
75%      42.000000     2.000000    3972.250000    24.000000
max      75.000000     3.000000   18424.000000    72.000000